jmeter/report/statistics.json
{
  "GET Validate Token" : {
    "transaction" : "GET Validate Token",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 44.333333333333336,
    "medianResTime" : 31.0,
    "minResTime" : 22.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 80.0,
    "pct3ResTime" : 80.0,
    "throughput" : 11.11111111111111,
    "receivedKBytesPerSec" : 2.083333333333333,
    "sentKBytesPerSec" : 1.66015625
  },
  "POST Register Bad Email (400)" : {
    "transaction" : "POST Register Bad Email (400)",
    "sampleCount" : 2,
    "errorCount" : 2,
    "errorPct" : 100.0,
    "meanResTime" : 249.0,
    "medianResTime" : 249.0,
    "minResTime" : 100.0,
    "maxResTime" : 398.0,
    "pct1ResTime" : 398.0,
    "pct2ResTime" : 398.0,
    "pct3ResTime" : 398.0,
    "throughput" : 5.025125628140704,
    "receivedKBytesPerSec" : 3.655975188442211,
    "sentKBytesPerSec" : 1.3642430904522613
  },
  "GET Profile" : {
    "transaction" : "GET Profile",
    "sampleCount" : 3,
    "errorCount" : 3,
    "errorPct" : 100.0,
    "meanResTime" : 80.0,
    "medianResTime" : 96.0,
    "minResTime" : 32.0,
    "maxResTime" : 112.0,
    "pct1ResTime" : 112.0,
    "pct2ResTime" : 112.0,
    "pct3ResTime" : 112.0,
    "throughput" : 24.193548387096772,
    "receivedKBytesPerSec" : 3.4730972782258065,
    "sentKBytesPerSec" : 3.4730972782258065
  },
  "GET All Categories" : {
    "transaction" : "GET All Categories",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 238.8,
    "medianResTime" : 85.0,
    "minResTime" : 56.0,
    "maxResTime" : 706.0,
    "pct1ResTime" : 706.0,
    "pct2ResTime" : 706.0,
    "pct3ResTime" : 706.0,
    "throughput" : 2.9744199881023197,
    "receivedKBytesPerSec" : 5.4230880056513975,
    "sentKBytesPerSec" : 0.36599308447352763
  },
  "GET All Products" : {
    "transaction" : "GET All Products",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 145.90000000000003,
    "medianResTime" : 145.5,
    "minResTime" : 63.0,
    "maxResTime" : 223.0,
    "pct1ResTime" : 221.5,
    "pct2ResTime" : 223.0,
    "pct3ResTime" : 223.0,
    "throughput" : 3.4258307639602603,
    "receivedKBytesPerSec" : 17.025442146282973,
    "sentKBytesPerSec" : 0.41484669407331276
  },
  "GET Products by Category" : {
    "transaction" : "GET Products by Category",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 3.502626970227671,
    "receivedKBytesPerSec" : 4.14910792469352,
    "sentKBytesPerSec" : 0.0
  },
  "POST Login Invalid (401)" : {
    "transaction" : "POST Login Invalid (401)",
    "sampleCount" : 2,
    "errorCount" : 2,
    "errorPct" : 100.0,
    "meanResTime" : 106.5,
    "medianResTime" : 106.5,
    "minResTime" : 93.0,
    "maxResTime" : 120.0,
    "pct1ResTime" : 120.0,
    "pct2ResTime" : 120.0,
    "pct3ResTime" : 120.0,
    "throughput" : 5.58659217877095,
    "receivedKBytesPerSec" : 1.4239263268156426,
    "sentKBytesPerSec" : 1.3148131983240223
  },
  "GET All Orders" : {
    "transaction" : "GET All Orders",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 145.2,
    "medianResTime" : 121.0,
    "minResTime" : 70.0,
    "maxResTime" : 281.0,
    "pct1ResTime" : 281.0,
    "pct2ResTime" : 281.0,
    "pct3ResTime" : 281.0,
    "throughput" : 2.6136957658128592,
    "receivedKBytesPerSec" : 0.37520827888133823,
    "sentKBytesPerSec" : 0.37265584161003656
  },
  "POST Refresh Token" : {
    "transaction" : "POST Refresh Token",
    "sampleCount" : 3,
    "errorCount" : 3,
    "errorPct" : 100.0,
    "meanResTime" : 229.66666666666666,
    "medianResTime" : 201.0,
    "minResTime" : 185.0,
    "maxResTime" : 303.0,
    "pct1ResTime" : 303.0,
    "pct2ResTime" : 303.0,
    "pct3ResTime" : 303.0,
    "throughput" : 7.874015748031496,
    "receivedKBytesPerSec" : 1.999261811023622,
    "sentKBytesPerSec" : 1.6686146653543308
  },
  "POST Create Product No Auth (401)" : {
    "transaction" : "POST Create Product No Auth (401)",
    "sampleCount" : 2,
    "errorCount" : 2,
    "errorPct" : 100.0,
    "meanResTime" : 92.0,
    "medianResTime" : 92.0,
    "minResTime" : 76.0,
    "maxResTime" : 108.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 108.0,
    "pct3ResTime" : 108.0,
    "throughput" : 5.361930294906166,
    "receivedKBytesPerSec" : 0.7697302278820375,
    "sentKBytesPerSec" : 1.3561913538873995
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 52,
    "errorCount" : 29,
    "errorPct" : 55.76923,
    "meanResTime" : 130.32692307692312,
    "medianResTime" : 102.0,
    "minResTime" : 0.0,
    "maxResTime" : 706.0,
    "pct1ResTime" : 301.5,
    "pct2ResTime" : 377.8499999999998,
    "pct3ResTime" : 706.0,
    "throughput" : 6.27564566739078,
    "receivedKBytesPerSec" : 9.401800665278785,
    "sentKBytesPerSec" : 0.806612810765146
  },
  "GET Category by ID" : {
    "transaction" : "GET Category by ID",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 192.8,
    "medianResTime" : 288.0,
    "minResTime" : 30.0,
    "maxResTime" : 305.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 305.0,
    "pct3ResTime" : 305.0,
    "throughput" : 6.510416666666667,
    "receivedKBytesPerSec" : 2.5177001953125,
    "sentKBytesPerSec" : 1.0363260904947917
  },
  "GET Non-existent Product (404)" : {
    "transaction" : "GET Non-existent Product (404)",
    "sampleCount" : 2,
    "errorCount" : 2,
    "errorPct" : 100.0,
    "meanResTime" : 238.5,
    "medianResTime" : 238.5,
    "minResTime" : 110.0,
    "maxResTime" : 367.0,
    "pct1ResTime" : 367.0,
    "pct2ResTime" : 367.0,
    "pct3ResTime" : 367.0,
    "throughput" : 3.316749585406302,
    "receivedKBytesPerSec" : 0.9717039800995025,
    "sentKBytesPerSec" : 0.5214811359867331
  }
}